// Створюємо асинхронну функцію bulkRun, яка приймає масив функцій для виконання.
async function bulkRun(functions) {
    // Використовуємо Promise.all для паралельного виконання всіх функцій.
    // Функція map перетворює кожну пару [функція, параметри] на проміс.
    return Promise.all(functions.map(([func, args]) => 
        // Для кожної функції створюємо новий проміс.
        new Promise((resolve) => 
            // Виконуємо функцію з її параметрами і додаємо функцію зворотного виклику resolve.
            func(...args, resolve)
        )
    ));
}

// Створюємо декілька прикладів функцій для виконання.
const f1 = (cb) => setTimeout(() => cb(1), 500);
const f2 = (a, cb) => setTimeout(() => cb(a), 300);
const f3 = (a, b, cb) => setTimeout(() => cb([a, b]), 1000);

// Створюємо масив функцій та їх параметрів для виконання.
const functionsToRun = [
    [f1, []],      // Виклик f1 без параметрів.
    [f2, [2]],     // Виклик f2 з параметром 2.
    [f3, [3, 4]],  // Виклик f3 з параметрами 3 і 4.
];

// Викликаємо функцію bulkRun з масивом функцій та їх параметрів. 
// Результати всіх функцій будуть виведені в консоль.
bulkRun(functionsToRun).then(console.log);
